=========
#commands
=========

#check 2+2
#eval 2+2
#reduce 2+2

---

(source_file
  (hash_command (binary_expression (number) (number)))
  (hash_command (binary_expression (number) (number)))
  (hash_command (binary_expression (number) (number))))

===================
Same Line #commands
===================

#eval id 2 #eval 5

---

(source_file
  (hash_command (apply (identifier) (number)))
  (hash_command (number)))

====
open
====

open Foo

---

(source_file (open (identifier)))

=======
Example
=======

example : (fun x => x * 2) 4 < 3 = false := rfl

---

(source_file
  (example
    (binary_expression
      (comparison
        (apply
          (lambda (parameter_list (identifier))
            (binary_expression (identifier) (number))) (number))
        (number))
      (identifier))
    (identifier)))

==============
Inductive Type
==============

inductive FooBar where
  | foo    : Foo
  | bar    : Bar

---

(source_file
  (inductive_type (identifier)
    (constructor (identifier) (identifier))
    (constructor (identifier) (identifier))))

========
Instance
========

instance : ToString Foo where
  toString (d : Foo) : String := "Foo"

---

(source_file
  (instance (apply (identifier) (identifier))
    (instance_fields
      (identifier)
      (parameter_list (annotated (identifier) (identifier)))
      (identifier)
      (string))))

==============
Named Instance
==============

instance toStringFoo : ToString Foo where
  toString (d : Foo) : String := "Foo"

---

(source_file
  (instance (identifier) (apply (identifier) (identifier))
    (instance_fields
      (identifier)
      (parameter_list (annotated (identifier) (identifier)))
      (identifier)
      (string))))
