=========
#commands
=========

#check 2+2
#eval 2+2
#reduce 2+2

---

(source_file
  (hash_command (binary_expression (number) (number)))
  (hash_command (binary_expression (number) (number)))
  (hash_command (binary_expression (number) (number))))

===================
Same Line #commands
===================

#eval id 2 #eval 5

---

(source_file
  (hash_command (apply (identifier) (number)))
  (hash_command (number)))

=======
Prelude
=======

prelude
import Foo

---

(source_file
  (prelude)
  (import (dotted_name (identifier))))

====
Open
====

open Foo

---

(source_file (open (identifier)))

======
Import
======

import Foo

---

(source_file (import (dotted_name (identifier))))

=============
Import Nested
=============

import Foo.Bar.Baz

---

(source_file (import (dotted_name (identifier) (identifier) (identifier))))
