======
Simple
======

def sampleFunction1 x := x*x + 3

def result1 := sampleFunction1 4573

theorem foo : p := sorry

---

(source_file
  (def (identifier)
    (parameters (identifier))
    (binary_expression (binary_expression (identifier) (identifier)) (number)))
  (def (identifier)
    (apply (identifier) (number)))
  (theorem (identifier) (identifier) (identifier)))

=========
Annotated
=========

def sampleFunction2 (x : Nat) := 2*x*x - x + 3

---

(source_file
  (def
    name: (identifier)
    parameters:
      (parameters
        name: (identifier)
        type: (identifier))
    body:
      (binary_expression
        (binary_expression
          (binary_expression
          (binary_expression (number) (identifier))
            (identifier))
            (identifier))
        (number))))

==================
Multiple Annotated
==================

def sampleFunction2 (x y : Nat) := x + y

---

(source_file
  (def
    name: (identifier)
    parameters:
      (parameters
        name: (identifier)
        name: (identifier)
        type: (identifier))
    body:
      (binary_expression (identifier) (identifier))))

==================
Implicit Arguments
==================

def foo {a} {b c : Nat} v w (x y) (z : Nat) := a + b + v + w + x + y

---

(source_file
  (def
    name: (identifier)
    parameters:
      (parameters
        (implicit_parameter
          name: (identifier))
        (implicit_parameter
          name: (identifier)
          name: (identifier)
          type: (identifier))
        name: (identifier)
        name: (identifier)
        name: (identifier)
        name: (identifier)
        name: (identifier)
        type: (identifier))
    body:
      (binary_expression
        (binary_expression
          (binary_expression
            (binary_expression
              (binary_expression
                (identifier)
                (identifier))
              (identifier))
            (identifier))
          (identifier))
        (identifier))))

====================
First Class Function
====================

def twice (f : Nat → Nat) (a : Nat) :=
  f (f a)

---

(source_file
  (def
    name: (identifier)
    parameters:
      (parameters
        name: (identifier)
        type: (function_annotation (identifier) (identifier))
        name: (identifier)
        type: (identifier))
    body:
      (apply
        name: (identifier)
        arguments:
          (apply
            name: (identifier)
            arguments: (identifier)))))

====================
Function Return Type
====================

def foo : Nat -> Nat := id

---

(source_file
  (def
    name: (identifier)
    return_type: (function_annotation (identifier) (identifier))
    body: (identifier)))

==================================
Multiargument Function Return Type
==================================

def foo : Nat -> Nat -> Nat -> Nat := id

---

(source_file
  (def
    name: (identifier)
    return_type: (function_annotation
                    (identifier) (identifier) (identifier) (identifier))
    body: (identifier)))

============
Conditionals
============

def sampleFunction3 (x : Int) :=
if x > 100 then
  2*x*x - x + 3
else
  2*x*x + x - 37

---

(source_file
(def
  name: (identifier)
  parameters:
    (parameters
      name: (identifier)
      type: (identifier))
  body:
    (conditional (comparison (identifier) (number))
        (binary_expression
          (binary_expression
            (binary_expression
              (binary_expression (number) (identifier))
              (identifier))
            (identifier))
          (number))
        (binary_expression
          (binary_expression
            (binary_expression
              (binary_expression (number) (identifier))
              (identifier))
            (identifier))
          (number)))))


=======
Theorem
=======

theorem twiceAdd2 (a : Nat) : twice (fun x => x + 2) a = a + 4 :=
-- The proof is by reflexivity. Lean "symbolically" reduces both sides of the equality
-- until they are identical.
  rfl

---

(source_file
(theorem
  name: (identifier)
  parameters:
    (parameters
      name: (identifier)
      type: (identifier))
    (binary_expression
      (apply
        name: (identifier)
        arguments:
          (lambda
            (parameters
              name: (identifier))
            (binary_expression (identifier) (number)))
        arguments:
          (identifier))
      (binary_expression (identifier) (number)))
    (comment) (comment)
  body:
    (identifier)))

================
Partial Function
================

partial def g x : Nat := g (x + 1)

---

(source_file
  (def (identifier)
    (parameters (identifier))
    (identifier)
    (apply (identifier) (binary_expression (identifier) (number)))))

=========
Structure
=========

structure Point (α : Type u) where
  x : α
  y : α

---

(source_file
  (structure_definition
    name: (identifier)
    parameters:
      (parameters
        name: (identifier)
        type:
          (apply
            name: (identifier)
            arguments: (identifier)))
    fields:
      (structure_field
        name: (identifier)
        type: (identifier))
    fields:
      (structure_field
        name: (identifier)
        type: (identifier))))
